/////////////////////////////////////////////////
//
// Класс обертки над управляемым потоком
// Copyright(c) 2016 UAShota
//
// Rev F  2018.11.04
//
/////////////////////////////////////////////////

#pragma once

#include "pch.h"

// Класс управляемого потока
class TThread : public std::thread
{
private:
    // Признак остановленного потока
	bool m_Terminated = false;
public:
    // Деструктор с остановкой потока
    ~TThread();
    // Возвращение признака остановленного потока
    bool IsTerminated();
    // Установка признака остановки потока
    void Terminate();
};